examples/dfLowMachFoam/oneD_freelyPropagation/CH4/cvodeSolver/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1";
    object       U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
4335
(
(0.404607944919761 0.0 0.0)
(0.404607944919761 0.0 0.0)
(0.404607944919761 0.0 0.0)
(0.404607944919761 0.0 0.0)
(0.404607944919761 0.0 0.0)
(0.404607944919761 0.0 0.0)
(0.404607944919761 0.0 0.0)
(0.404607944919761 0.0 0.0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 0.40460794 0.000000 0.000000 );
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            empty;
    }
}


// ************************************************************************* //
