examples/dfLowMachFoam/oneD_freelyPropagation/CH4/cvodeSolver/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object       p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar>
4335
(
1.013250000000000e+05
1.013250000000000e+05
1.013250000000000e+05
1.013250000000000e+05
1.013250000000000e+05
1.013250000000000e+05
1.013250000000000e+05
1.013250000000000e+05
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            waveTransmissive;
        gamma            1.4;
    }
    wall
    {
        type            empty;
    }
}


// ************************************************************************* //
